; domain
;;Created by Tomas de la Rosa
;;Domain for painting floor tiles with two colors
(define (domain floor-tile)
(:requirements :typing)
(:types robot tile color - object)
(:predicates
        (robot-at ?r - robot ?x - tile)
        (up ?x - tile ?y - tile)
        (down ?x - tile ?y - tile)
        (right ?x - tile ?y - tile)
        (left ?x - tile ?y - tile)
        (clear ?x - tile)
        (painted ?x - tile ?c - color)
        (robot-has ?r - robot ?c - color)
        (available-color ?c - color)
        (free-color ?r - robot))

(:action change-color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2))
)
(:action paint-up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)
(:action paint-down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)
; Robot movements
(:action up
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)
(:action down
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)
(:action right
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)
(:action left
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)
)

; problem
(define (problem instance20)
 (:domain floor-tile)
 (:objects tile_0-1 tile_0-2 tile_0-3 
           tile_1-1 tile_1-2 tile_1-3 
           tile_2-1 tile_2-2 tile_2-3 
           tile_3-1 tile_3-2 tile_3-3 
           tile_4-1 tile_4-2 tile_4-3 
           tile_5-1 tile_5-2 tile_5-3 - tile
           robot1 robot2 - robot
           white black - color
)
 (:init 

   (robot-at robot1 tile_0-2)
   (robot-has robot1 white)
   (robot-at robot2 tile_2-1)
   (robot-has robot2 black)
   (available-color white)
   (available-color black)
   (clear tile_0-1)
   (clear tile_0-3)
   (clear tile_1-1)
   (clear tile_1-2)
   (clear tile_1-3)
   (clear tile_2-2)
   (clear tile_2-3)
   (clear tile_3-1)
   (clear tile_3-2)
   (clear tile_3-3)
   (clear tile_4-1)
   (clear tile_4-2)
   (clear tile_4-3)
   (clear tile_5-1)
   (clear tile_5-2)
   (clear tile_5-3)
   (up tile_1-1 tile_0-1)
   (up tile_1-2 tile_0-2)
   (up tile_1-3 tile_0-3)
   (up tile_2-1 tile_1-1)
   (up tile_2-2 tile_1-2)
   (up tile_2-3 tile_1-3)
   (up tile_3-1 tile_2-1)
   (up tile_3-2 tile_2-2)
   (up tile_3-3 tile_2-3)
   (up tile_4-1 tile_3-1)
   (up tile_4-2 tile_3-2)
   (up tile_4-3 tile_3-3)
   (up tile_5-1 tile_4-1)
   (up tile_5-2 tile_4-2)
   (up tile_5-3 tile_4-3)
   (down tile_0-1 tile_1-1)
   (down tile_0-2 tile_1-2)
   (down tile_0-3 tile_1-3)
   (down tile_1-1 tile_2-1)
   (down tile_1-2 tile_2-2)
   (down tile_1-3 tile_2-3)
   (down tile_2-1 tile_3-1)
   (down tile_2-2 tile_3-2)
   (down tile_2-3 tile_3-3)
   (down tile_3-1 tile_4-1)
   (down tile_3-2 tile_4-2)
   (down tile_3-3 tile_4-3)
   (down tile_4-1 tile_5-1)
   (down tile_4-2 tile_5-2)
   (down tile_4-3 tile_5-3)
   (right tile_0-2 tile_0-1)
   (right tile_0-3 tile_0-2)
   (right tile_1-2 tile_1-1)
   (right tile_1-3 tile_1-2)
   (right tile_2-2 tile_2-1)
   (right tile_2-3 tile_2-2)
   (right tile_3-2 tile_3-1)
   (right tile_3-3 tile_3-2)
   (right tile_4-2 tile_4-1)
   (right tile_4-3 tile_4-2)
   (right tile_5-2 tile_5-1)
   (right tile_5-3 tile_5-2)
   (left tile_0-1 tile_0-2)
   (left tile_0-2 tile_0-3)
   (left tile_1-1 tile_1-2)
   (left tile_1-2 tile_1-3)
   (left tile_2-1 tile_2-2)
   (left tile_2-2 tile_2-3)
   (left tile_3-1 tile_3-2)
   (left tile_3-2 tile_3-3)
   (left tile_4-1 tile_4-2)
   (left tile_4-2 tile_4-3)
   (left tile_5-1 tile_5-2)
   (left tile_5-2 tile_5-3)
)
 (:goal (and
    (painted tile_1-1 white)
    (painted tile_1-2 black)
    (painted tile_1-3 white)
    (painted tile_2-1 black)
    (painted tile_2-2 white)
    (painted tile_2-3 black)
    (painted tile_3-1 white)
    (painted tile_3-2 black)
    (painted tile_3-3 white)
    (painted tile_4-1 black)
    (painted tile_4-2 white)
    (painted tile_4-3 black)
    (painted tile_5-1 white)
    (painted tile_5-2 black)
    (painted tile_5-3 white)
))
 
)

; plan
1. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 0 of 15
2. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 0 of 15
3. (right robot2 tile_2-1 tile_2-2)
   deleted: (robot-at robot2 tile_2-1) (clear tile_2-2)
   added: (robot-at robot2 tile_2-2) (clear tile_2-1)
   goals met: 0 of 15
4. (left robot1 tile_0-2 tile_0-1)
   deleted: (robot-at robot1 tile_0-2) (clear tile_0-1)
   added: (robot-at robot1 tile_0-1) (clear tile_0-2)
   goals met: 0 of 15
5. (up robot2 tile_2-2 tile_3-2)
   deleted: (robot-at robot2 tile_2-2) (clear tile_3-2)
   added: (robot-at robot2 tile_3-2) (clear tile_2-2)
   goals met: 0 of 15
6. (right robot1 tile_0-1 tile_0-2)
   deleted: (robot-at robot1 tile_0-1) (clear tile_0-2)
   added: (robot-at robot1 tile_0-2) (clear tile_0-1)
   goals met: 0 of 15
7. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 0 of 15
8. (up robot2 tile_3-2 tile_4-2)
   deleted: (robot-at robot2 tile_3-2) (clear tile_4-2)
   added: (robot-at robot2 tile_4-2) (clear tile_3-2)
   goals met: 0 of 15
9. (paint-up robot2 tile_5-2 tile_4-2 black)
   deleted: (clear tile_5-2)
   added: (painted tile_5-2 black)
   goals met: 1 of 15
10. (right robot1 tile_0-2 tile_0-3)
   deleted: (robot-at robot1 tile_0-2) (clear tile_0-3)
   added: (robot-at robot1 tile_0-3) (clear tile_0-2)
   goals met: 1 of 15
11. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 1 of 15
12. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 1 of 15
13. (down robot2 tile_4-2 tile_3-2)
   deleted: (robot-at robot2 tile_4-2) (clear tile_3-2)
   added: (robot-at robot2 tile_3-2) (clear tile_4-2)
   goals met: 1 of 15
14. (paint-up robot2 tile_4-2 tile_3-2 white)
   deleted: (clear tile_4-2)
   added: (painted tile_4-2 white)
   goals met: 2 of 15
15. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 2 of 15
16. (up robot1 tile_0-3 tile_1-3)
   deleted: (robot-at robot1 tile_0-3) (clear tile_1-3)
   added: (robot-at robot1 tile_1-3) (clear tile_0-3)
   goals met: 2 of 15
17. (up robot1 tile_1-3 tile_2-3)
   deleted: (robot-at robot1 tile_1-3) (clear tile_2-3)
   added: (robot-at robot1 tile_2-3) (clear tile_1-3)
   goals met: 2 of 15
18. (up robot1 tile_2-3 tile_3-3)
   deleted: (robot-at robot1 tile_2-3) (clear tile_3-3)
   added: (robot-at robot1 tile_3-3) (clear tile_2-3)
   goals met: 2 of 15
19. (left robot2 tile_3-2 tile_3-1)
   deleted: (robot-at robot2 tile_3-2) (clear tile_3-1)
   added: (robot-at robot2 tile_3-1) (clear tile_3-2)
   goals met: 2 of 15
20. (left robot1 tile_3-3 tile_3-2)
   deleted: (robot-at robot1 tile_3-3) (clear tile_3-2)
   added: (robot-at robot1 tile_3-2) (clear tile_3-3)
   goals met: 2 of 15
21. (up robot2 tile_3-1 tile_4-1)
   deleted: (robot-at robot2 tile_3-1) (clear tile_4-1)
   added: (robot-at robot2 tile_4-1) (clear tile_3-1)
   goals met: 2 of 15
22. (paint-up robot2 tile_5-1 tile_4-1 white)
   deleted: (clear tile_5-1)
   added: (painted tile_5-1 white)
   goals met: 3 of 15
23. (down robot2 tile_4-1 tile_3-1)
   deleted: (robot-at robot2 tile_4-1) (clear tile_3-1)
   added: (robot-at robot2 tile_3-1) (clear tile_4-1)
   goals met: 3 of 15
24. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 3 of 15
25. (paint-up robot2 tile_4-1 tile_3-1 black)
   deleted: (clear tile_4-1)
   added: (painted tile_4-1 black)
   goals met: 4 of 15
26. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 4 of 15
27. (down robot2 tile_3-1 tile_2-1)
   deleted: (robot-at robot2 tile_3-1) (clear tile_2-1)
   added: (robot-at robot2 tile_2-1) (clear tile_3-1)
   goals met: 4 of 15
28. (paint-up robot2 tile_3-1 tile_2-1 white)
   deleted: (clear tile_3-1)
   added: (painted tile_3-1 white)
   goals met: 5 of 15
29. (right robot1 tile_3-2 tile_3-3)
   deleted: (robot-at robot1 tile_3-2) (clear tile_3-3)
   added: (robot-at robot1 tile_3-3) (clear tile_3-2)
   goals met: 5 of 15
30. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 5 of 15
31. (down robot2 tile_2-1 tile_1-1)
   deleted: (robot-at robot2 tile_2-1) (clear tile_1-1)
   added: (robot-at robot2 tile_1-1) (clear tile_2-1)
   goals met: 5 of 15
32. (paint-up robot2 tile_2-1 tile_1-1 black)
   deleted: (clear tile_2-1)
   added: (painted tile_2-1 black)
   goals met: 6 of 15
33. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 6 of 15
34. (down robot1 tile_3-3 tile_2-3)
   deleted: (robot-at robot1 tile_3-3) (clear tile_2-3)
   added: (robot-at robot1 tile_2-3) (clear tile_3-3)
   goals met: 6 of 15
35. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 6 of 15
36. (down robot2 tile_1-1 tile_0-1)
   deleted: (robot-at robot2 tile_1-1) (clear tile_0-1)
   added: (robot-at robot2 tile_0-1) (clear tile_1-1)
   goals met: 6 of 15
37. (left robot1 tile_2-3 tile_2-2)
   deleted: (robot-at robot1 tile_2-3) (clear tile_2-2)
   added: (robot-at robot1 tile_2-2) (clear tile_2-3)
   goals met: 6 of 15
38. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 6 of 15
39. (paint-up robot1 tile_3-2 tile_2-2 black)
   deleted: (clear tile_3-2)
   added: (painted tile_3-2 black)
   goals met: 7 of 15
40. (paint-up robot2 tile_1-1 tile_0-1 white)
   deleted: (clear tile_1-1)
   added: (painted tile_1-1 white)
   goals met: 8 of 15
41. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 8 of 15
42. (right robot2 tile_0-1 tile_0-2)
   deleted: (robot-at robot2 tile_0-1) (clear tile_0-2)
   added: (robot-at robot2 tile_0-2) (clear tile_0-1)
   goals met: 8 of 15
43. (right robot1 tile_2-2 tile_2-3)
   deleted: (robot-at robot1 tile_2-2) (clear tile_2-3)
   added: (robot-at robot1 tile_2-3) (clear tile_2-2)
   goals met: 8 of 15
44. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 8 of 15
45. (up robot1 tile_2-3 tile_3-3)
   deleted: (robot-at robot1 tile_2-3) (clear tile_3-3)
   added: (robot-at robot1 tile_3-3) (clear tile_2-3)
   goals met: 8 of 15
46. (up robot1 tile_3-3 tile_4-3)
   deleted: (robot-at robot1 tile_3-3) (clear tile_4-3)
   added: (robot-at robot1 tile_4-3) (clear tile_3-3)
   goals met: 8 of 15
47. (paint-up robot1 tile_5-3 tile_4-3 white)
   deleted: (clear tile_5-3)
   added: (painted tile_5-3 white)
   goals met: 9 of 15
48. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 9 of 15
49. (down robot1 tile_4-3 tile_3-3)
   deleted: (robot-at robot1 tile_4-3) (clear tile_3-3)
   added: (robot-at robot1 tile_3-3) (clear tile_4-3)
   goals met: 9 of 15
50. (paint-up robot1 tile_4-3 tile_3-3 black)
   deleted: (clear tile_4-3)
   added: (painted tile_4-3 black)
   goals met: 10 of 15
51. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 10 of 15
52. (up robot2 tile_0-2 tile_1-2)
   deleted: (robot-at robot2 tile_0-2) (clear tile_1-2)
   added: (robot-at robot2 tile_1-2) (clear tile_0-2)
   goals met: 10 of 15
53. (down robot1 tile_3-3 tile_2-3)
   deleted: (robot-at robot1 tile_3-3) (clear tile_2-3)
   added: (robot-at robot1 tile_2-3) (clear tile_3-3)
   goals met: 10 of 15
54. (paint-up robot1 tile_3-3 tile_2-3 white)
   deleted: (clear tile_3-3)
   added: (painted tile_3-3 white)
   goals met: 11 of 15
55. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 11 of 15
56. (paint-up robot2 tile_2-2 tile_1-2 white)
   deleted: (clear tile_2-2)
   added: (painted tile_2-2 white)
   goals met: 12 of 15
57. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 12 of 15
58. (down robot2 tile_1-2 tile_0-2)
   deleted: (robot-at robot2 tile_1-2) (clear tile_0-2)
   added: (robot-at robot2 tile_0-2) (clear tile_1-2)
   goals met: 12 of 15
59. (paint-up robot2 tile_1-2 tile_0-2 black)
   deleted: (clear tile_1-2)
   added: (painted tile_1-2 black)
   goals met: 13 of 15
60. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 13 of 15
61. (right robot2 tile_0-2 tile_0-3)
   deleted: (robot-at robot2 tile_0-2) (clear tile_0-3)
   added: (robot-at robot2 tile_0-3) (clear tile_0-2)
   goals met: 13 of 15
62. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 13 of 15
63. (down robot1 tile_2-3 tile_1-3)
   deleted: (robot-at robot1 tile_2-3) (clear tile_1-3)
   added: (robot-at robot1 tile_1-3) (clear tile_2-3)
   goals met: 13 of 15
64. (paint-up robot1 tile_2-3 tile_1-3 black)
   deleted: (clear tile_2-3)
   added: (painted tile_2-3 black)
   goals met: 14 of 15
65. (left robot2 tile_0-3 tile_0-2)
   deleted: (robot-at robot2 tile_0-3) (clear tile_0-2)
   added: (robot-at robot2 tile_0-2) (clear tile_0-3)
   goals met: 14 of 15
66. (down robot1 tile_1-3 tile_0-3)
   deleted: (robot-at robot1 tile_1-3) (clear tile_0-3)
   added: (robot-at robot1 tile_0-3) (clear tile_1-3)
   goals met: 14 of 15
67. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 14 of 15
68. (paint-up robot1 tile_1-3 tile_0-3 white)
   deleted: (clear tile_1-3)
   added: (painted tile_1-3 white)
   goals met: 15 of 15
